In [1]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [7]:
s.index.name = '네임'

In [5]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [9]:
s

네임
서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [10]:
s = s/1000

In [15]:
s['서울']

9904.312

In [16]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [21]:
s1 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158}, index =["서울","인천","부산","대전"])
s1

서울    9631482
인천    2632035
부산    3393191
대전    1490158
dtype: int64

In [22]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035}, index =["서울","인천","부산"])
s2

서울    9631482
인천    2632035
부산    3393191
dtype: int64

In [23]:
s = s2 - s1

In [25]:
s.notnull()

대전    False
부산     True
서울     True
인천     True
dtype: bool

In [28]:
s[s.notnull()]

부산    0.0
서울    0.0
인천    0.0
dtype: float64

In [29]:
s["경기"] = 1213243

In [31]:
s

대전          NaN
부산          0.0
서울          0.0
인천          0.0
경기    1213243.0
dtype: float64

In [63]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"] # 순서 지정
index = ["서울", "부산", "인천", "대구"] # 순서 지정
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [25]:
df.loc['경기'] = ['수도권',12123,141341,14354,12414,0.23]

In [35]:
df.loc[df.shape[0]] = ['수도권',12121,12341231,1241241,1414,0.3]

In [65]:
df.loc[:,"지역"].count()

4

In [45]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [48]:
df["증가폭"] = np.where(df["2010-2015 증가율"]>=2,"큼","작음")

In [23]:
df

,\t\t지점번호,지점명,일시,평균기온(℃),평균최고기온(℃),최고기온(℃),\t최고기온일자,평균최저기온(℃),최저기온(℃),최저기온일자
0,\t\t108,서울,1907-10-01,13.9,20.2,25.4,1907-10-05,8.3,3.3,1907-10-24
1,\t\t108,서울,1907-11-01,5.3,10.2,21.3,1907-11-01,0.6,-8.9,1907-11-30
2,\t\t108,서울,1907-12-01,-3.9,0.8,9.0,1907-12-13,-8.7,-20.1,1907-12-23
3,\t\t108,서울,1908-01-01,-3.5,0.1,6.2,1908-01-31,-7.5,-14.3,1908-01-22
4,\t\t108,서울,1908-02-01,-4.0,0.8,8.4,1908-02-27,-8.8,-15.8,1908-02-07
...,...,...,...,...,...,...,...,...,...,...
1348,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1349,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1350,\t\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1351,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1352,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [60]:
df['지역'][1:3]

AttributeError: 'Series' object has no attribute 'column'

In [61]:
df[ ["2010", "2015"] ]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [67]:
type(df[ "2010" ])

pandas.core.series.Series

In [68]:
df[["2010"]]
type(df[["2010"]])

pandas.core.frame.DataFrame

In [71]:
df[["2010"]][1:3]

       2010
부산  3393191
인천  2632035

In [22]:
#행 추가는 어떻게 해야??
df.columns

{'지역':"경기", '2015':12121, '2010':12398434, '2005':1284324, '2000':1202434, '2010-2015 증가율':21.4, '증가폭':}

SyntaxError: ':' expected after dictionary key (1249874958.py, line 4)

In [78]:
df.loc['경기'] = [142124,1432123541,12412421,141424,124124,21.3,"큼"]

In [79]:
df

        지역        2015      2010     2005     2000  2010-2015 증가율 증가폭
서울     수도권     9904312   9631482  9762546  9853972           2.83   큼
부산     경상권     3448737   3393191  3512547  3655437           1.63  작음
인천     수도권     2890451   2632035  2517680  2466338           9.82   큼
대구     경상권     2466052   2431774  2456016  2473990           1.41  작음
경기  142124  1432123541  12412421   141424   124124          21.30   큼

In [187]:
pd.read_csv("C:\workspace\python\WASSUP\data/기상온도_서울202012.csv")

UnicodeDecodeError: 'utf-8' codec can't decode byte 0xc1 in position 3: invalid start byte

In [66]:
df = pd.read_csv("C:\workspace\python\WASSUP\data/기상온도_서울202012.csv", encoding="cp949")

In [12]:
df.to_e("file이름.csv")

In [14]:
pd.read_csv("C:\workspace\python\WASSUP\\file이름.csv")

,Unnamed: 0,\t\t지점번호,지점명,일시,평균기온(℃),평균최고기온(℃),최고기온(℃),\t최고기온일자,평균최저기온(℃),최저기온(℃),최저기온일자
0,0,\t\t108,서울,1907-10-01,13.9,20.2,25.4,1907-10-05,8.3,3.3,1907-10-24
1,1,\t\t108,서울,1907-11-01,5.3,10.2,21.3,1907-11-01,0.6,-8.9,1907-11-30
2,2,\t\t108,서울,1907-12-01,-3.9,0.8,9.0,1907-12-13,-8.7,-20.1,1907-12-23
3,3,\t\t108,서울,1908-01-01,-3.5,0.1,6.2,1908-01-31,-7.5,-14.3,1908-01-22
4,4,\t\t108,서울,1908-02-01,-4.0,0.8,8.4,1908-02-27,-8.8,-15.8,1908-02-07
...,...,...,...,...,...,...,...,...,...,...,...
1348,1348,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1349,1349,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1350,1350,\t\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1351,1351,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1352,1352,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [19]:
df.loc[3,"일시"]

'1908-01-01'

In [42]:
df.iloc[df.shape[0]-1,df.shape[1]-1]

,\t\t지점번호,지점명,일시,평균기온(℃),평균최고기온(℃),최고기온(℃),\t최고기온일자,평균최저기온(℃),최저기온(℃),최저기온일자
0,\t\t108,서울,1907-10-01,13.9,20.2,25.4,1907-10-05,8.3,3.3,1907-10-24
1,\t\t108,서울,1907-11-01,5.3,10.2,21.3,1907-11-01,0.6,-8.9,1907-11-30
2,\t\t108,서울,1907-12-01,-3.9,0.8,9.0,1907-12-13,-8.7,-20.1,1907-12-23
3,\t\t108,서울,1908-01-01,-3.5,0.1,6.2,1908-01-31,-7.5,-14.3,1908-01-22
4,\t\t108,서울,1908-02-01,-4.0,0.8,8.4,1908-02-27,-8.8,-15.8,1908-02-07
...,...,...,...,...,...,...,...,...,...,...
1348,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1349,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1350,\t\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1351,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1352,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [62]:
df.loc[0].count()

10

In [67]:
df.value_counts()

\t\t지점번호  지점명  일시          평균기온(℃)  평균최고기온(℃)  최고기온(℃)  \t최고기온일자    평균최저기온(℃)  최저기온(℃)  최저기온일자
\t\t108   서울   1907-10-01   13.9    20.2       25.4     1907-10-05   8.3        3.3     1907-10-24    1
               1984-11-01   8.1     12.9       21.2     1984-11-06   4.1       -5.7     1984-11-28    1
               1984-09-01   20.1    25.0       28.7     1984-09-07   16.3       10.1    1984-09-26    1
               1984-08-01   26.3    30.5       35.2     1984-08-10   23.3       18.9    1984-08-17    1
               1984-07-01   25.2    29.5       34.7     1984-07-31   22.0       19.2    1984-07-17    1
                                                                                                     ..
               1944-05-01   15.9    22.4       29.3     1944-05-29   10.8       4.6     1944-05-06    1
               1944-04-01   9.6     16.1       23.4     1944-04-30   4.1       -0.9     1944-04-04    1
               1944-03-01   3.2     8.9        18.2     1944-03-27  -1.8       -6.6     1944-03-07    1
               1944-02-01  -2.4     2.7        9.7      1944-02-29  -8.0       -13.4    1944-02-08    1
               2020-12-01  -0.2     4.0        9.4      2020-12-11  -4.1       -11.2    2020-12-16    1
Name: count, Length: 1320, dtype: int64

In [188]:
#np.random.seed(10000000)
s2 = pd.Series(np.random.randint(10, size=100))
s2.head(3)

0    3
1    1
2    0
dtype: int32

In [124]:
s2.value_counts().sort_values(ascending=True) #시리즈에서는

1    14
5    15
4    15
3    16
0    18
2    22
Name: count, dtype: int64

In [132]:
s2.sum()

241

In [131]:
df.sort_values(by=["평균기온(℃)","최고기온(℃)"],ascending=False)

,\t\t지점번호,지점명,일시,평균기온(℃),평균최고기온(℃),최고기온(℃),\t최고기온일자,평균최저기온(℃),최저기온(℃),최저기온일자
1316,\t\t108,서울,2018-08-01,28.8,33.3,39.6,2018-08-01,25.2,20.2,2018-08-27
1027,\t\t108,서울,1994-07-01,28.5,32.6,38.4,1994-07-24,25.3,21.3,1994-07-02
1292,\t\t108,서울,2016-08-01,28.0,32.6,36.6,2016-08-21,24.5,16.1,2016-08-31
1315,\t\t108,서울,2018-07-01,27.8,32.1,38.3,2018-07-31,24.2,17.7,2018-07-08
430,\t\t108,서울,1943-08-01,27.8,34.6,38.2,1943-08-24,23.1,15.4,1943-08-31
...,...,...,...,...,...,...,...,...,...,...
1348,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1349,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1350,\t\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1351,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1352,\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [141]:
df[["평균기온(℃)","평균최고기온(℃)","최고기온(℃)"]].sum(axis=0)

평균기온(℃)      15425.0
평균최고기온(℃)    22032.9
최고기온(℃)      30864.2
dtype: float64

,\t\t지점번호,지점명,일시,평균기온(℃),평균최고기온(℃),최고기온(℃),\t최고기온일자,평균최저기온(℃),최저기온(℃),최저기온일자
0,\t\t108,서울,1907-10-01,13.9,20.2,25.4,1907-10-05,8.3,3.3,1907-10-24
1,\t\t108,서울,1907-11-01,5.3,10.2,21.3,1907-11-01,0.6,-8.9,1907-11-30
2,\t\t108,서울,1907-12-01,-3.9,0.8,9.0,1907-12-13,-8.7,-20.1,1907-12-23
3,\t\t108,서울,1908-01-01,-3.5,0.1,6.2,1908-01-31,-7.5,-14.3,1908-01-22
4,\t\t108,서울,1908-02-01,-4.0,0.8,8.4,1908-02-27,-8.8,-15.8,1908-02-07
5,\t\t108,서울,1908-03-01,2.9,8.1,18.2,1908-03-29,-1.7,-7.4,1908-03-02
6,\t\t108,서울,1908-04-01,10.1,16.5,22.9,1908-04-20,4.6,-0.7,1908-04-07
7,\t\t108,서울,1908-05-01,14.9,21.1,25.2,1908-05-25,10.0,5.2,1908-05-04
8,\t\t108,서울,1908-06-01,20.7,26.8,32.4,1908-06-23,16.3,11.6,1908-06-08
9,\t\t108,서울,1908-07-01,23.5,27.6,32.9,1908-07-24,20.3,14.7,1908-07-06

In [146]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [152]:
df3.apply(lambda x: print(x),axis=1)

A    1
B    2
C    1
Name: 0, dtype: int64
A    3
B    3
C    5
Name: 1, dtype: int64
A    4
B    1
C    2
Name: 2, dtype: int64
A    3
B    2
C    4
Name: 3, dtype: int64
A    4
B    3
C    4
Name: 4, dtype: int64

0    None
1    None
2    None
3    None
4    None
dtype: object

In [2]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [3]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [4]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

['Q1', 'Q2', 'Q4', 'Q3', 'Q1', ..., 'Q1', 'Q2', 'Q3', 'Q4', 'Q1']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [5]:
np.round(np.random.rand(3, 5), 2)

array([[0.85, 0.89, 0.84, 0.86, 0.12],
       [0.65, 0.21, 0.09, 0.61, 0.24],
       [0.71, 0.39, 0.74, 0.54, 0.15]])

In [6]:
np.vstack([list('ABCDE'), np.round(np.random.rand(3, 5), 2)])

array([['A', 'B', 'C', 'D', 'E'],
       ['0.45', '0.22', '0.74', '0.78', '0.99'],
       ['0.62', '0.82', '0.29', '0.42', '0.02'],
       ['0.13', '0.52', '0.37', '0.85', '0.5']], dtype='<U32')

In [7]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'), np.round(np.random.rand(3, 5), 2)]).T, # transpose
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [8]:
df2 = df1.set_index("C1")
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [9]:
df2.set_index("C2")

        C3    C4
C2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

In [10]:
df2.reset_index()

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07